In [7]:
import pandas as pd

In [9]:
prof = pd.read_csv('교수.csv')
prof

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [10]:
filt = prof['교수번호'] == 221
prof[filt]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000

In [12]:
prof.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   교수번호    4 non-null      int64
 1   교수이름    4 non-null      object
 2   교수학과    4 non-null      object
 3   임용일     4 non-null      object
 4   교수직급    4 non-null      object
 5   급여      4 non-null      int64
dtypes: int64(2), object(4)
memory usage: 320.0+ bytes

In [13]:
prof['교수번호'] = prof['교수번호'].astype(str)
prof.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   교수번호    4 non-null      object
 1   교수이름    4 non-null      object
 2   교수학과    4 non-null      object
 3   임용일     4 non-null      object
 4   교수직급    4 non-null      object
 5   급여      4 non-null      int64
dtypes: int64(1), object(5)
memory usage: 320.0+ bytes

In [14]:
prof.set_index('교수번호', inplace=True)
prof

     교수이름 교수학과       임용일 교수직급       급여
교수번호
221   이병렬   전산  75/04/03  정교수  3000000
228   이재광   전산  91/09/19  부교수  2500000
311   강승일   전자  94/06/09  부교수  2300000
509   오문환   건축  92/10/14  조교수  2000000

In [16]:
prof.loc['221']

교수이름         이병렬
교수학과          전산
임용일     75/04/03
교수직급         정교수
급여       3000000
Name: 221, dtype: object

In [17]:
stu = pd.read_csv('학생.csv', index_col='학생번호')
stu

         학생이름 학생학과  학년      생년월일  지도교수
학생번호
92414029  서연우   전산   3  73/10/06   228
92414033  김창덕   전산   4  73/10/26   221
92514009  이지행   전자   4  73/11/16   311
92514023  김형명   전자   4  73/08/29   311
92454018  이원구   건축   3  74/09/30   509
95454003  이재영   건축   4  76/02/06   509
95414058  박혜경   전산   4  76/03/12   221
96414404  김수정   전산   3  77/12/22   228